<a href="https://colab.research.google.com/github/MeenTers/KKU_data_mining/blob/master/Assignment2.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Import Function

In [1]:
import pandas as pd
import os
import numpy as np
import datetime as dt

In [2]:
from google.colab import drive
drive.mount('/content/drive')

Mounted at /content/drive

In [3]:
path = '/content/drive/My Drive/SIST'

In [4]:
data_path = os.path.join(path,'A2.xlsx')

# DataFrame

In [5]:
data1 = pd.read_excel(data_path,sheet_name='Year 2009-2010')
data1.head()

  Invoice StockCode  ... Customer ID         Country
0  489434     85048  ...     13085.0  United Kingdom
1  489434    79323P  ...     13085.0  United Kingdom
2  489434    79323W  ...     13085.0  United Kingdom
3  489434     22041  ...     13085.0  United Kingdom
4  489434     21232  ...     13085.0  United Kingdom

[5 rows x 8 columns]

In [6]:
data1.count()

Invoice        525461
StockCode      525461
Description    522533
Quantity       525461
InvoiceDate    525461
Price          525461
Customer ID    417534
Country        525461
dtype: int64

In [7]:
data2 = pd.read_excel(data_path,sheet_name='Year 2010-2011')
data2.head()

  Invoice StockCode  ... Customer ID         Country
0  536365    85123A  ...     17850.0  United Kingdom
1  536365     71053  ...     17850.0  United Kingdom
2  536365    84406B  ...     17850.0  United Kingdom
3  536365    84029G  ...     17850.0  United Kingdom
4  536365    84029E  ...     17850.0  United Kingdom

[5 rows x 8 columns]

In [8]:
data2.count()

Invoice        541910
StockCode      541910
Description    540456
Quantity       541910
InvoiceDate    541910
Price          541910
Customer ID    406830
Country        541910
dtype: int64

In [9]:
all_table = pd.concat([data1,data2])
all_table

       Invoice StockCode  ... Customer ID         Country
0       489434     85048  ...     13085.0  United Kingdom
1       489434    79323P  ...     13085.0  United Kingdom
2       489434    79323W  ...     13085.0  United Kingdom
3       489434     22041  ...     13085.0  United Kingdom
4       489434     21232  ...     13085.0  United Kingdom
...        ...       ...  ...         ...             ...
541905  581587     22899  ...     12680.0          France
541906  581587     23254  ...     12680.0          France
541907  581587     23255  ...     12680.0          France
541908  581587     22138  ...     12680.0          France
541909  581587      POST  ...     12680.0          France

[1067371 rows x 8 columns]

# Clean Data

In [10]:
all_table.isnull().any()

Invoice        False
StockCode      False
Description     True
Quantity       False
InvoiceDate    False
Price          False
Customer ID     True
Country        False
dtype: bool

In [11]:
all_table.dropna(subset=['Customer ID'],inplace=True)
all_table

       Invoice StockCode  ... Customer ID         Country
0       489434     85048  ...     13085.0  United Kingdom
1       489434    79323P  ...     13085.0  United Kingdom
2       489434    79323W  ...     13085.0  United Kingdom
3       489434     22041  ...     13085.0  United Kingdom
4       489434     21232  ...     13085.0  United Kingdom
...        ...       ...  ...         ...             ...
541905  581587     22899  ...     12680.0          France
541906  581587     23254  ...     12680.0          France
541907  581587     23255  ...     12680.0          France
541908  581587     22138  ...     12680.0          France
541909  581587      POST  ...     12680.0          France

[824364 rows x 8 columns]

In [12]:
all_table.isnull().any()

Invoice        False
StockCode      False
Description    False
Quantity       False
InvoiceDate    False
Price          False
Customer ID    False
Country        False
dtype: bool

# UK Data

In [56]:
uk_data = all_table[all_table['Country']=='United Kingdom']
uk_data = uk_data[uk_data['Price'] > 0 ]
uk_data = uk_data[uk_data['Quantity'] > 0 ]
uk_data

       Invoice StockCode  ... Customer ID         Country
0       489434     85048  ...     13085.0  United Kingdom
1       489434    79323P  ...     13085.0  United Kingdom
2       489434    79323W  ...     13085.0  United Kingdom
3       489434     22041  ...     13085.0  United Kingdom
4       489434     21232  ...     13085.0  United Kingdom
...        ...       ...  ...         ...             ...
541889  581585     22466  ...     15804.0  United Kingdom
541890  581586     22061  ...     13113.0  United Kingdom
541891  581586     23275  ...     13113.0  United Kingdom
541892  581586     21217  ...     13113.0  United Kingdom
541893  581586     20685  ...     13113.0  United Kingdom

[725250 rows x 8 columns]

In [57]:
uk_data[uk_data['Price'] < 0 ]

Empty DataFrame
Columns: [Invoice, StockCode, Description, Quantity, InvoiceDate, Price, Customer ID, Country]
Index: []

# Monetary

In [58]:
uk_data['Total'] = uk_data['Price'] * uk_data['Quantity']
uk_data

       Invoice StockCode  ...         Country  Total
0       489434     85048  ...  United Kingdom   83.4
1       489434    79323P  ...  United Kingdom   81.0
2       489434    79323W  ...  United Kingdom   81.0
3       489434     22041  ...  United Kingdom  100.8
4       489434     21232  ...  United Kingdom   30.0
...        ...       ...  ...             ...    ...
541889  581585     22466  ...  United Kingdom   23.4
541890  581586     22061  ...  United Kingdom   23.6
541891  581586     23275  ...  United Kingdom   30.0
541892  581586     21217  ...  United Kingdom  214.8
541893  581586     20685  ...  United Kingdom   70.8

[725250 rows x 9 columns]

In [59]:
monetary_uk = uk_data[['Customer ID','Total']]
monetary_uk.head()

   Customer ID  Total
0      13085.0   83.4
1      13085.0   81.0
2      13085.0   81.0
3      13085.0  100.8
4      13085.0   30.0

In [61]:
monetary_uk = monetary_uk.groupby('Customer ID').sum()
monetary_uk

                Total
Customer ID
12346.0      77556.46
12608.0        415.79
12745.0        723.85
12746.0        254.55
12747.0       9276.54
...               ...
18283.0       2736.65
18284.0        461.68
18285.0        427.00
18286.0       1296.43
18287.0       4182.99

[5350 rows x 1 columns]

# Recency

In [62]:
recency_uk  = uk_data[['Customer ID','InvoiceDate']]
maximum = max(recency_uk['InvoiceDate'])
maximum

Timestamp('2011-12-09 12:49:00')

In [63]:
# Filtering data for customerid and invoice_date
recency_uk  = uk_data[['Customer ID','InvoiceDate']]

# Finding max data
#maximum = max(recency_uk['InvoiceDate'])
df_max_purchase = uk_data.groupby('Customer ID').InvoiceDate.max().reset_index()
# Adding one more day to the max data, so that the max date will have 1 as the difference and not zero.
maximum = maximum + pd.DateOffset(days=1)
recency_uk['different'] = maximum - recency_uk['InvoiceDate']
recency_uk['DiffDays'] = recency_uk['different'].dt.days
recency_uk

/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:9: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  if __name__ == '__main__':
/usr/local/lib/python3.7/dist-packages/ipykernel_launcher.py:10: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  # Remove the CWD from sys.path while we load stuff.

        Customer ID         InvoiceDate         different  DiffDays
0           13085.0 2009-12-01 07:45:00 739 days 05:04:00       739
1           13085.0 2009-12-01 07:45:00 739 days 05:04:00       739
2           13085.0 2009-12-01 07:45:00 739 days 05:04:00       739
3           13085.0 2009-12-01 07:45:00 739 days 05:04:00       739
4           13085.0 2009-12-01 07:45:00 739 days 05:04:00       739
...             ...                 ...               ...       ...
541889      15804.0 2011-12-09 12:31:00   1 days 00:18:00         1
541890      13113.0 2011-12-09 12:49:00   1 days 00:00:00         1
541891      13113.0 2011-12-09 12:49:00   1 days 00:00:00         1
541892      13113.0 2011-12-09 12:49:00   1 days 00:00:00         1
541893      13113.0 2011-12-09 12:49:00   1 days 00:00:00         1

[725250 rows x 4 columns]

In [64]:
uk_cus = recency_uk.groupby('Customer ID')
uk_cus['DiffDays'].min()

Customer ID
12346.0    326
12608.0    405
12745.0    487
12746.0    541
12747.0      2
          ...
18283.0      4
18284.0    432
18285.0    661
18286.0    477
18287.0     43
Name: DiffDays, Length: 5350, dtype: int64

In [65]:
#Dataframe merging by recency
uk_recen = pd.DataFrame(recency_uk.groupby('Customer ID').DiffDays.min())
uk_recen = uk_recen.reset_index()
uk_recen.columns = ['Customer ID', 'Recency']
uk_recen.head()

   Customer ID  Recency
0      12346.0      326
1      12608.0      405
2      12745.0      487
3      12746.0      541
4      12747.0        2

# Frequency

In [66]:
frequency_uk = uk_data[['Customer ID', 'Invoice']]

In [67]:
# Getting the count of orders made by each customer based on customer ID.
freq_uk = frequency_uk.groupby('Customer ID').Invoice.count()
freq_uk = pd.DataFrame(freq_uk)
freq_uk = freq_uk.reset_index()
freq_uk.columns = ['Customer ID', 'Frequency']
freq_uk.head()

   Customer ID  Frequency
0      12346.0         34
1      12608.0         16
2      12745.0         22
3      12746.0         17
4      12747.0        257

# RFM combined DataFrame

In [68]:
#Combining all recency, frequency and monetary parameters
RFM_uk = freq_uk.merge(monetary_uk, on = 'Customer ID')
RFM_uk = RFM_uk.merge(uk_recen, on = 'Customer ID')
RFM_uk

      Customer ID  Frequency     Total  Recency
0         12346.0         34  77556.46      326
1         12608.0         16    415.79      405
2         12745.0         22    723.85      487
3         12746.0         17    254.55      541
4         12747.0        257   9276.54        2
...           ...        ...       ...      ...
5345      18283.0        986   2736.65        4
5346      18284.0         28    461.68      432
5347      18285.0         12    427.00      661
5348      18286.0         67   1296.43      477
5349      18287.0        155   4182.99       43

[5350 rows x 4 columns]

In [69]:
#RFM score values 
RFM_uk['Recency_Score'] = pd.qcut(RFM_uk['Recency'],5,labels=[5,4,3,2,1])
RFM_uk['Frequency_Score'] = pd.qcut(RFM_uk['Frequency'].rank(method="first"),5,labels=[1,2,3,4,5])
RFM_uk['Monetary_Score'] = pd.qcut(RFM_uk['Total'],5,labels=[1,2,3,4,5])
RFM_uk

      Customer ID  Frequency  ...  Frequency_Score  Monetary_Score
0         12346.0         34  ...                2               5
1         12608.0         16  ...                1               2
2         12745.0         22  ...                2               3
3         12746.0         17  ...                2               1
4         12747.0        257  ...                5               5
...           ...        ...  ...              ...             ...
5345      18283.0        986  ...                5               4
5346      18284.0         28  ...                2               2
5347      18285.0         12  ...                1               2
5348      18286.0         67  ...                3               4
5349      18287.0        155  ...                4               5

[5350 rows x 7 columns]

In [70]:
#RFM score values are combined side by side in str format
(RFM_uk['Recency_Score'].astype(str) + 
 RFM_uk['Frequency_Score'].astype(str) + 
 RFM_uk['Monetary_Score'].astype(str)).head()

0    225
1    212
2    123
3    121
4    555
dtype: object

In [71]:
RFM_uk['RFM_Segment'] = RFM_uk['Recency_Score'].astype(str) + RFM_uk['Frequency_Score'].astype(str) + RFM_uk['Monetary_Score'].astype(str)
RFM_uk

      Customer ID  Frequency  ...  Monetary_Score  RFM_Segment
0         12346.0         34  ...               5          225
1         12608.0         16  ...               2          212
2         12745.0         22  ...               3          123
3         12746.0         17  ...               1          121
4         12747.0        257  ...               5          555
...           ...        ...  ...             ...          ...
5345      18283.0        986  ...               4          554
5346      18284.0         28  ...               2          122
5347      18285.0         12  ...               2          112
5348      18286.0         67  ...               4          134
5349      18287.0        155  ...               5          445

[5350 rows x 8 columns]

In [72]:
#transposition of the RFM table. This makes it easier to evaluate.
RFM_uk.describe().T

              count          mean           std  ...       50%        75%        max
Customer ID  5350.0  15557.362617   1581.161762  ...  15565.50  16922.750   18287.00
Frequency    5350.0    135.560748    326.055839  ...     53.00    142.000   12890.00
Total        5350.0   2751.990190  12080.466564  ...    849.91   2214.905  608821.65
Recency      5350.0    203.000935    209.959231  ...     98.50    382.000     739.00

[4 rows x 8 columns]

In [74]:
# Calculate RFM_Score
RFM_uk['RFM_Score'] = RFM_uk[['Recency_Score','Frequency_Score','Monetary_Score']].sum(axis=1)
print(RFM_uk['RFM_Score'].head())

0     9
1     5
2     6
3     4
4    15
Name: RFM_Score, dtype: int64

In [77]:
# Define rfm_level function
def rfm_level(RFM_uk):
    if RFM_uk['RFM_Score'] >= 9:
        return 'Can\'t Loose Them'
    elif ((RFM_uk['RFM_Score'] >= 8) and (RFM_uk['RFM_Score'] < 9)):
        return 'Champions'
    elif ((RFM_uk['RFM_Score'] >= 7) and (RFM_uk['RFM_Score'] < 8)):
        return 'Loyal'
    elif ((RFM_uk['RFM_Score'] >= 6) and (RFM_uk['RFM_Score'] < 7)):
        return 'Potential'
    elif ((RFM_uk['RFM_Score'] >= 5) and (RFM_uk['RFM_Score'] < 6)):
        return 'Promising'
    elif ((RFM_uk['RFM_Score'] >= 4) and (RFM_uk['RFM_Score'] < 5)):
        return 'Needs Attention'
    else:
        return 'Require Activation'
# Create a new variable RFM_Level
RFM_uk['RFM_Level'] = RFM_uk.apply(rfm_level, axis=1)
# Print the header with top 5 rows to the console
RFM_uk.head()

   Customer ID  Frequency     Total  ...  RFM_Segment RFM_Score         RFM_Level
0      12346.0         34  77556.46  ...          225         9  Can't Loose Them
1      12608.0         16    415.79  ...          212         5         Promising
2      12745.0         22    723.85  ...          123         6         Potential
3      12746.0         17    254.55  ...          121         4   Needs Attention
4      12747.0        257   9276.54  ...          555        15  Can't Loose Them

[5 rows x 10 columns]

In [81]:
# Calculate average values for each RFM_Level, and return a size of each segment 
rfm_level_agg = RFM_uk.groupby('RFM_Level').agg({
    'Recency': 'mean',
    'Frequency': 'mean',
    'Total': ['mean', 'count']
}).round(1)
# Print the aggregated dataset
print(rfm_level_agg)

                   Recency Frequency   Total
                      mean      mean    mean count
RFM_Level
Can't Loose Them      81.4     230.2  4717.1  2879
Champions            207.6      47.3   931.0   426
Loyal                253.6      33.8   663.9   453
Needs Attention      450.6      12.9   199.7   376
Potential            285.9      24.2   408.0   454
Promising            380.6      19.6   316.5   448
Require Activation   569.3       7.6   137.6   314

# K-means

In [ ]:
from sklearn.cluster import KMeans

In [ ]:
def my_kmean(X):
    KMclust = KMeans(n_clusters=3,random_state=10)
    KMclust.fit(X)
    label = KMclust.predict(X)
    return label

In [ ]:
kmeans_recen = my_kmean(RFM_uk[['Recency']])
kmeans_recen

In [ ]:
kmeans_total = my_kmean(RFM_uk[['Total']])
kmeans_total

In [ ]:
kmeans_freq = my_kmean(RFM_uk[['Frequency']])
kmeans_freq

In [ ]:
RFM_uk['Group of Frequency'] = kmeans_freq
RFM_uk['Group of Total'] = kmeans_total 
RFM_uk['Group of Recency'] = kmeans_recen
RFM_uk

# Definition of Group K-mean

In [ ]:
def mygroupby(x,y):
    values = RFM_uk.groupby(x)[y].describe()
    return values

In [ ]:
mygroupby('Group of Frequency','Frequency')

In [ ]:
mygroupby('Group of Total','Total')

In [ ]:
mygroupby('Group of Recency','Recency')